app/Http/Controllers/Web/WebController.php

update `notifications` set `read` = 1 where `notify_id` in ('')
select * from `videos` where `video_id` = 0 limit 1
select `v`.`video`, `v`.`user_id` from `videos` as `v` left join `users` as `u` on `u`.`user_id` = `v`.`user_id` where `u`.`active` = 1 and `u`.`deleted` = 0 and `v`.`active` = 1 and `v`.`flag` = 0 and `v`.`privacy` = 0 and `v`.`deleted` = 0 order by RAND() limit 1
---
    public function home(Request $request)
    {
        $cookieExists = Cookie :: get('videoViewed');
        // dd($cookieExists);
        if ($cookieExists == null) {
            $cookieTime = time() + 60 * 60 * 24 * 30; // 30 days
            $token = str_random(32);

            Cookie :: queue('videoViewed', $token, $cookieTime);
            DB::table('unique_users_ids')->insert(['unique_token' => $token]);

        }
        $notifIds = explode(',', request()->get('notify_ids'));

        if (!empty($notifIds)) {
            DB::table('notifications')
                ->whereIn('notify_id', $notifIds)
                ->update(['read' => 1,]);
        }

        $video = DB::table('videos')->where('video_id', intval(request()->get('videoId')))->first();
        $sharedVideoId = '';
        $sharedVideoSrc = '';

        $homeHeaderVideo = DB::table('videos as v')->select('v.video','v.user_id')
                            ->leftJoin('users as u','u.user_id','v.user_id')
                            ->where('u.active',1)
                            ->where('u.deleted',0)
                            ->where('v.active',1)
                            ->where('v.flag',0)
                            ->where('v.privacy',0)
                            ->where('v.deleted',0)
                            ->inRandomOrder()->first();

select * from `home_settings` limit 1
---
            $sharedVideoId = request()->get('videoId');
            $sharedVideoSrc = asset(Storage::url('public/videos/' . $video->user_id . '/' . $video->video ));
        }
        $home_data=DB::table('home_settings')->first();