app/Http/Controllers/Admin/SponsorController.php

    public function edit($id)
    {
        $action = 'edit';

        $sponsor = DB::table('sponsors')->select(DB::raw("*"))->where('sponsor_id','=',$id)->first();
---
select * from `sponsors` where `sponsor_id` = '1' limit 1

    public function update(Request $request, $id)
    {
        $data = $this->_form_validation($request);

        DB::table('sponsors')->where('sponsor_id',$id)->update($data);
---
update `sponsors` set `image` = '20210507113650_SponsorIcon.png', `heading` = 'Unify SoftTech', `title` = 'Leuke APP', `url` = 'https://www.unifysofttech.com', `active` = '1' where `sponsor_id` = '1'

    public function count_all($request)
    {
        $candidateRS = DB::table('sponsors')->select(DB::raw("count(*) as total"))->first();
---
select count(*) as total from `sponsors` limit 1